2020-08-01 16:26:15.493992: I tensorflow/stream_executor/platform/default/dso_loader.cc:44] Successfully opened dynamic library libcuda.so.1
2020-08-01 16:26:15.523375: E tensorflow/stream_executor/cuda/cuda_driver.cc:313] failed call to cuInit: CUDA_ERROR_NO_DEVICE: no CUDA-capable device is detected
2020-08-01 16:26:15.523489: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:156] kernel driver does not appear to be running on this host (dmusial98-MSI): /proc/driver/nvidia/version does not exist
2020-08-01 16:26:15.524178: I tensorflow/core/platform/cpu_feature_guard.cc:143] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2 FMA
2020-08-01 16:26:15.658883: I tensorflow/core/platform/profile_utils/cpu_utils.cc:102] CPU Frequency: 2799925000 Hz
2020-08-01 16:26:15.660088: I tensorflow/compiler/xla/service/service.cc:168] XLA service 0x7ff73c000b60 initialized for platform Host (this does not guarantee that XLA will be used). Devices:
2020-08-01 16:26:15.660157: I tensorflow/compiler/xla/service/service.cc:176]   StreamExecutor device (0): Host, Default Version
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 222, 222, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 111, 111, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 109, 109, 64)      18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 54, 54, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 52, 52, 128)       73856     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 26, 26, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 24, 24, 128)       147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 12, 12, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 18432)             0         
_________________________________________________________________
dense (Dense)                (None, 512)               9437696   
_________________________________________________________________
dense_1 (Dense)              (None, 10)                5130      
=================================================================
Total params: 9,683,658
Trainable params: 9,683,658
Non-trainable params: 0
_________________________________________________________________
Found 7500 images belonging to 10 classes.
Found 1500 images belonging to 10 classes.
Found 2000 images belonging to 10 classes.
(64, 224, 224, 3)
(64, 10)
WARNING:tensorflow:From main.py:100: Model.fit_generator (from tensorflow.python.keras.engine.training) is deprecated and will be removed in a future version.
Instructions for updating:
Please use Model.fit, which supports generators.
Epoch 1/30
118/117 [==============================] - 290s 2s/step - loss: 1.9785 - acc: 0.2909 - val_loss: 1.7099 - val_acc: 0.3933
Epoch 2/30
118/117 [==============================] - 306s 3s/step - loss: 1.6311 - acc: 0.4349 - val_loss: 1.4868 - val_acc: 0.4907
Epoch 3/30
118/117 [==============================] - 290s 2s/step - loss: 1.4699 - acc: 0.4960 - val_loss: 1.3954 - val_acc: 0.5140
Epoch 4/30
118/117 [==============================] - 294s 2s/step - loss: 1.3591 - acc: 0.5429 - val_loss: 1.3714 - val_acc: 0.5200
Epoch 5/30
118/117 [==============================] - 273s 2s/step - loss: 1.2526 - acc: 0.5744 - val_loss: 1.2848 - val_acc: 0.5500
Epoch 6/30
118/117 [==============================] - 260s 2s/step - loss: 1.1726 - acc: 0.5983 - val_loss: 1.2459 - val_acc: 0.5560
Epoch 7/30
118/117 [==============================] - 267s 2s/step - loss: 1.0729 - acc: 0.6339 - val_loss: 1.4763 - val_acc: 0.5073
Epoch 8/30
118/117 [==============================] - 246s 2s/step - loss: 0.9891 - acc: 0.6691 - val_loss: 1.2589 - val_acc: 0.5707
Epoch 9/30
118/117 [==============================] - 290s 2s/step - loss: 0.9036 - acc: 0.6991 - val_loss: 1.2962 - val_acc: 0.5580
Epoch 10/30
118/117 [==============================] - 253s 2s/step - loss: 0.8177 - acc: 0.7279 - val_loss: 1.2849 - val_acc: 0.5860
Epoch 11/30
118/117 [==============================] - 284s 2s/step - loss: 0.7192 - acc: 0.7645 - val_loss: 1.4195 - val_acc: 0.5427
Epoch 12/30
118/117 [==============================] - 280s 2s/step - loss: 0.6353 - acc: 0.7885 - val_loss: 1.3995 - val_acc: 0.5693
Epoch 13/30
118/117 [==============================] - 285s 2s/step - loss: 0.5465 - acc: 0.8272 - val_loss: 1.4773 - val_acc: 0.5560
Epoch 14/30
118/117 [==============================] - 268s 2s/step - loss: 0.4571 - acc: 0.8535 - val_loss: 1.5129 - val_acc: 0.5593
Epoch 15/30
118/117 [==============================] - 255s 2s/step - loss: 0.3711 - acc: 0.8865 - val_loss: 1.5966 - val_acc: 0.5700
Epoch 16/30
118/117 [==============================] - 268s 2s/step - loss: 0.2984 - acc: 0.9085 - val_loss: 1.5896 - val_acc: 0.5773
Epoch 17/30
118/117 [==============================] - 284s 2s/step - loss: 0.2266 - acc: 0.9325 - val_loss: 2.0728 - val_acc: 0.5513
Epoch 18/30
118/117 [==============================] - 273s 2s/step - loss: 0.1711 - acc: 0.9532 - val_loss: 1.7193 - val_acc: 0.5800
Epoch 19/30
118/117 [==============================] - 237s 2s/step - loss: 0.1287 - acc: 0.9668 - val_loss: 1.9391 - val_acc: 0.5693
Epoch 20/30
 61/117 [==============>...............] - ETA: 1:43 - loss: 0.1048 - acc: 0.974 62/117 [==============>...............] - ETA: 1:41 - loss: 0.1049 - acc: 0.974 63/117 [===============>..............] - ETA: 1:40 - loss: 0.1043 - acc: 0.974 64/117 [===============>..............] - ETA: 1:38 - loss: 0.1033 - acc: 0.974 65/117 [===============>..............] - ETA: 1:36 - loss: 0.1022 - acc: 0.975 66/117 [=========== 6118/117 [==============================] - 233s 2s/step - loss: 0.1024 - acc: 0.9731 - val_loss: 1.9425 - val_acc: 0.5807==========>..........] - ETA: 1:07 - loss: 0.0994 - acc: 0.9755
Epoch 21/30
118/117 [==============================] - 238s 2s/step - loss: 0.0907 - acc: 0.9752 - val_loss: 2.0269 - val_acc: 0.5833
Epoch 22/30
118/117 [==============================] - 242s 2s/step - loss: 0.0748 - acc: 0.9831 - val_loss: 2.4132 - val_acc: 0.5387
Epoch 23/30
118/117 [==============================] - 265s 2s/step - loss: 0.0686 - acc: 0.9843 - val_loss: 2.1423 - val_acc: 0.5847
Epoch 24/30
118/117 [==============================] - 254s 2s/step - loss: 0.0562 - acc: 0.9884 - val_loss: 2.3304 - val_acc: 0.5860
Epoch 25/30
118/117 [==============================] - 252s 2s/step - loss: 0.0592 - acc: 0.9872 - val_loss: 2.3005 - val_acc: 0.5833
Epoch 26/30
118/117 [==============================] - 257s 2s/step - loss: 0.0497 - acc: 0.9895 - val_loss: 2.3393 - val_acc: 0.5793
Epoch 27/30
118/117 [==============================] - 261s 2s/step - loss: 0.0468 - acc: 0.9899 - val_loss: 2.3779 - val_acc: 0.5740
Epoch 28/30
118/117 [==============================] - 265s 2s/step - loss: 0.0399 - acc: 0.9913 - val_loss: 2.5435 - val_acc: 0.5887
Epoch 29/30
118/117 [==============================] - 278s 2s/step - loss: 0.0474 - acc: 0.9896 - val_loss: 2.3536 - val_acc: 0.5807
Epoch 30/30
118/117 [==============================] - 264s 2s/step - loss: 0.0424 - acc: 0.9933 - val_loss: 2.4664 - val_acc: 0.5913
